# IdeaStatiCa.ConnectionApi.Model.ConConnectionTemplate

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**LibraryTemplateId** | **Guid** |  | [optional]
**TemplateId** | **int** |  | [optional]
**Members** | **List&lt;ConItem&gt;** |  | [optional]
**Operations** | **List&lt;ConItem&gt;** |  | [optional]
**ParameterKeys** | **List&lt;string&gt;** |  | [optional]
**CommonProperties** | **ConOperationCommonProperties** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)